ФинансовыйДневник/src/DataProcessors/ЗагрузкаКурсаВалюты/ЗагрузкаКурсаВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсаВалюты</name>
</mdclass:DataProcessor>

ФинансовыйДневник/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФинансовыйДневник/src/DataProcessors/ЗагрузкаКурсаВалюты/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	// 1. Получить данные из ресурса в интернете (функция)
	// 2. Разобрать и записать полученные данные в регистр (процедура) 
	
	ДанныеОКурсахВалют = ДанныеОКурсахСсайта();
	
	ЗагрузитьДанныеОКурсахВалюты(ДанныеОКурсахВалют);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте // Обращение к сторонним данным с компьютера клиента
Функция ДанныеОКурсахСсайта()
	
	// адрес ресурса в интернете https://www.cbr-xml-daily.ru/daily_eng_utf8.xml
	
	// Данные получают за счет создаваемого соединения с сервером
	СоединениеССайтом = Новый HTTPСоединение("www.cbr-xml-daily.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
		
	// Запрос на сервер для получения ресурса
	Запрос = Новый HTTPЗапрос("/daily_eng_utf8.xml"); 
	
	// Получение ответа 
	Ответ = СоединениеССайтом.Получить(Запрос);
	
	// Анализ кода состояния (удачность соединения)
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Не удалось вызвать соединение с www.cbr-xml-daily.ru"
	КонецЕсли;
	
	ДанныеОтвета = Ответ.ПолучитьТелоКакСтроку();
		
	Возврат ДанныеОтвета;
	
КонецФункции

&НаСервере   // Данные записываются в базу данных
Процедура ЗагрузитьДанныеОКурсахВалюты(ДанныеОКурсахВалют)
	
	// Вызов метода для чтения полученнх данных (данные в виде строки XML) 
	Чтение = Новый ЧтениеXML();
	Чтение.УстановитьСтроку(ДанныеОКурсахВалют);
	
	// Представление полученной строки в виде дерева (для удобста чтения)
	ПостроитьDOM = Новый ПостроительDOM;
	ДеревоУзлов = ПостроитьDOM.Прочитать(Чтение);
	
	КодВалюты = "";
	Кратность = 0;
	Курс = 0;
	
	Для Каждого УзелВалюты Из ДеревоУзлов.ЭлементДокумента.ДочерниеУзлы Цикл
		
		Для Каждого УзелСвойстваВалюта Из УзелВалюты.ДочерниеУзлы Цикл
			
			Если УзелСвойстваВалюта.ИмяУзла = "CharCode" Тогда
				КодВалюты = УзелСвойстваВалюта.ТекстовоеСодержимое;
			КонецЕсли;
				
			Если УзелСвойстваВалюта.ИмяУзла = "Nominal" Тогда
				Кратность = Число(УзелСвойстваВалюта.ТекстовоеСодержимое);
			КонецЕсли;
			
			Если УзелСвойстваВалюта.ИмяУзла = "Value" Тогда
				Курс = Число(УзелСвойстваВалюта.ТекстовоеСодержимое);
			КонецЕсли;
				
		КонецЦикла;
		
		Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
		
		Если ЗначениеЗаполнено(Валюта) Тогда
			
			Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДатаСеанса();
			Запись.Валюта = Валюта;
			Запись.Кратность = Кратность;
			Запись.Курс = Курс;
			Запись.Записать(); 			
				
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Курсы валют загружены";
	Сообщение.Сообщить();
	
	// Закрытие вызванного метода чтения
	Чтение.Закрыть();	
	
КонецПроцедуры

#КонецОбласти
